#include <Morse.h>

Morse morse(13);
char MORSE[][4] = 
{
  {'.', '-', '*', '*'}, 
  {'-', '.', '.', '.'}, 
  {'-', '.', '-', '.'}, 
  {'-', '.', '.', '*'}, 
  {'.', '*', '*', '*'}, 
  {'.', '.', '-', '.'}, 
  {'-', '-', '.', '*'}, 
  {'.', '.', '.', '.'}, 
  {'.', '.', '*', '*'}, 
  {'.', '-', '-', '-'}, 
  {'-', '.', '-', '*'}, 
  {'.', '-', '.', '.'}, 
  {'-', '-', '*', '*'}, 
  {'-', '.', '*', '*'}, 
  {'-', '-', '-', '*'}, 
  {'.', '-', '-', '.'}, 
  {'-', '-', '.', '-'}, 
  {'.', '-', '.', '*'}, 
  {'.', '.', '.', '*'}, 
  {'-', '*', '*', '*'}, 
  {'.', '.', '-', '*'}, 
  {'.', '.', '.', '-'}, 
  {'.', '-', '-', '*'}, 
  {'-', '.', '.', '-'}, 
  {'-', '.', '-', '-'}, 
  {'-', '-', '.', '.'}  
};
//morse电码表
void setup()
{
  Serial.begin(9600);
}

void loop()
{
  String str = "";  //没有进行转义的字符串
  String morse_s = "";  //转义后的字符串
  int i, t , temp = 0;
  int n = 0;  //计数
  while (Serial.available() > 0)
  {
    temp = 1;  //数据是否传入
    str += char(Serial.read());  //将数据储存在字符串中
    delay(2000);  //延迟保证传入正常
    n++;
  }

  if (temp)
  {
    //根据Morse电码表并进行转换
    for (i = 0; i < n; i++)
    {
      for (t = 0; t < 4; t++)
      {
        //对小写字母进行转义
        if (str[i] >= 97 && str[i] <= 122)
        {
          morse_s += char(MORSE[int(str[i] - 97)][t]);
        }
      }
      morse_s += ' ';
    }
    Serial.println(morse_s);  //串口传入
    for (i = 0; morse_s[i]!='\0' ; i++)//读取莫尔斯电码
    {
      if (morse_s[i] == '.')morse.dot();
      else if (morse_s[i] == '-')morse.dash();
      else if (morse_s[i] == ' ')morse.w_space();
      if (morse_s[i] != ' ' && str[i] != '*')morse.c_space();
    }
    Serial.println("发送完毕");
    delay(2000);
  }
}
